app/views/users/addcourse.html.erb


  <%= f.collection_check_boxes :course_ids, Course.all, :id, :name, label:'Course' %><br>
---
SELECT "courses".* FROM "courses"