app/views/users/show.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "users_courses" ON "courses"."id" = "users_courses"."course_id" WHERE "users_courses"."user_id" = $1  [["user_id", 2]]
---
      <ul class="user-serie">
        <% @user.course.each do | course | %>