app/views/news/home.html.erb

SELECT "news".* FROM "news"
---
    <div class="container-fluid well container-md-6 container-news ">
      <h2 class="news-title"> No hay noticias :(</h2>
      <div class="news-body">El negro ql aun no pone noticias 77</div>
    </div>
  <%end%>
  <% @news.each do |n|%>
    <div class="container-fluid well container-md-6 container-news ">
      <h2 class="news-title"> <%= n.title %></h2>
      <div class="news-body"><%= n.body %></div>
    </div>
  <% end %>
</div>
