app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "hour", "teacher", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Lenguaje"], ["hour", 2], ["teacher", "tu"], ["created_at", "2017-08-07 05:12:48.251998"], ["updated_at", "2017-08-07 05:12:48.251998"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save