app/controllers/news_controller.rb

  def index
    @news = News.all
---
SELECT "news".* FROM "news"

  def home
    @news = News.all
---
SELECT "news".* FROM "news"

  def create
    @news = News.new(news_params)

    respond_to do |format|
      if @news.save
---
INSERT INTO "news" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test 1"], ["body", "primera noticia"], ["created_at", "2017-08-03 20:15:14.652327"], ["updated_at", "2017-08-03 20:15:14.652327"]]

    def set_news
      @news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]