app/controllers/users_controller.rb

  def addnewcourse
    @user = current_user
    course_ids =  user_params[:course_ids]
    course_ids.delete("")
    course_ids.each do |g|
      if !@user.course.exists?(g)
        @course = Course.find(g)
        @usercourse = UsersCourse.new()
        @usercourse.course = @course
        @usercourse.user = @user
        @usercourse.save
---
SELECT  "courses".* FROM "courses" INNER JOIN "users_courses" ON "courses"."id" = "users_courses"."course_id" WHERE "users_courses"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "courses" INNER JOIN "users_courses" ON "courses"."id" = "users_courses"."course_id" WHERE "users_courses"."user_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
INSERT INTO "users_courses" ("created_at", "updated_at", "user_id", "course_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-08-07 04:48:15.505791"], ["updated_at", "2017-08-07 04:48:15.505791"], ["user_id", 3], ["course_id", 1]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "rol" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "test"], ["rol", 0], ["updated_at", "2017-08-02 03:28:26.207724"], ["id", 1]]